print("Добро пожаловать в викторину 'Угадай год рождения знаменитости'!")
print("Вам будет задано 5 вопросов, постарайтесь ответить правильно на все!")
answer = None

while answer != "н":
    answer = " "
    score = 0
    # 1799
    year = int(input("1) Введите год рождения А.С.Пушкина"))
    if year == 1799:
        score += 1
    # 1828
    year = int(input("1) Введите год рождения Л.Н.Толстого"))
    if year == 1828:
        score += 1
    # 1814
    year = int(input("1) Введите год рождения М.Ю.Лермонтова"))
    if year == 1814:
        score += 1
    # 1903
    year = int(input("1) Введите год рождения И.В.Курчатова"))
    if year == 1903:
        score += 1
    # 1904
    year = int(input("1) Введите год рождения А.П.Гайдара"))
    if year == 1904:
        score += 1
    print("Игра окончена! Число правильных ответов:", score)
    print("Число неправильных ответов:", 5 - score)
    percent = score*20
    print("Процент правильных ответов:", percent)
    print("Процент неправильных ответов:", 100 - percent)
    while answer != "д" and answer != "н":
        answer = input("Хотите повторить игру? (д/н)")
print("Спасибо за участие!")